qm2813518589/LPC54606_Library/.pack/Keil/LPC54000_DFP.2.6.0/RTE_Driver/SPI_LPC5411x.c
/* -----------------------------------------------------------------------------
 * Copyright (c) 2013-2016 ARM Ltd.
 *
 * This software is provided 'as-is', without any express or implied warranty.
 * In no event will the authors be held liable for any damages arising from
 * the use of this software. Permission is granted to anyone to use this
 * software for any purpose, including commercial applications, and to alter
 * it and redistribute it freely, subject to the following restrictions:
 *
 * 1. The origin of this software must not be misrepresented; you must not
 *    claim that you wrote the original software. If you use this software in
 *    a product, an acknowledgment in the product documentation would be
 *    appreciated but is not required.
 *
 * 2. Altered source versions must be plainly marked as such, and must not be
 *    misrepresented as being the original software.
 *
 * 3. This notice may not be removed or altered from any source distribution.
 *
 *
 * $Date:        22. August 2016
 * $Revision:    V1.1
 *
 * Driver:       Driver_SPI0, Driver_SPI1, Driver_SPI2, Driver_SPI3,
 *               Driver_SPI4, Driver_SPI5, Driver_SPI6, Driver_SPI7
 * Configured:   via RTE_Device.h configuration file
 * Project:      SPI Driver for NXP LPC5411x
 * --------------------------------------------------------------------------
 * Use the following configuration settings in the middleware component
 * to connect to this driver.
 *
 *   Configuration Setting                 Value   SPI Interface
 *   ---------------------                 -----   -------------
 *   Connect to hardware via Driver_SPI# = 0       use SPI0
 *   Connect to hardware via Driver_SPI# = 1       use SPI1
 *   Connect to hardware via Driver_SPI# = 2       use SPI2
 *   Connect to hardware via Driver_SPI# = 3       use SPI3
 *   Connect to hardware via Driver_SPI# = 4       use SPI4
 *   Connect to hardware via Driver_SPI# = 5       use SPI5
 *   Connect to hardware via Driver_SPI# = 6       use SPI6
 *   Connect to hardware via Driver_SPI# = 7       use SPI7
 * -------------------------------------------------------------------------- */

/* Note:
    When using DMA data transfer mode, make sure that application calls function
    Chip_DMASERVICE_Isr (part of LPCOpen firmware package, see dma_service_5411x.h
    for details) to handle DMA IRQ requests. Two possible ways are as follows:

    a) Replace all occurences of DMA_IRQHandler in device startup code
       with Chip_DMASERVICE_Isr
    b) Implement DMA_IRQHandler function which calls Chip_DMASERVICE_Isr:
       void DMA_IRQHandler (void) {
         Chip_DMASERVICE_Isr();
       }
 */

/* History:
 *  Version 1.1
 *    - Code which has been bypassing a bug in Chip_DMASERVICE_SingleBuffer() is updated, due to 
 *      correction of the Chip_DMASERVICE_SingleBuffer() function.
 *  Version 1.0
 *    - Initial release
 */

#include "SPI_LPC5411x.h"

#define ARM_SPI_DRV_VERSION ARM_DRIVER_VERSION_MAJOR_MINOR(1,1) /* driver version */

/* Driver Version */
static const ARM_DRIVER_VERSION DriverVersion = {
  ARM_SPI_API_VERSION,
  ARM_SPI_DRV_VERSION
};

// Driver Capabilities
static const ARM_SPI_CAPABILITIES DriverCapabilities = {
  0,  // Simplex Mode (Master and Slave)
  0,  // TI Synchronous Serial Interface
  0,  // Microwire Interface
  0   // Signal Mode Fault event: \ref ARM_SPI_EVENT_MODE_FAULT
};


#if (RTE_SPI0)
/* SPI0 Control Information */
static SPI_INFO SPI0_Ctrl = { 0 };

#if defined(SPI0_DMA_EN)
static       void    SPI0_TX_DMA_Callback (int32_t);
static       void    SPI0_RX_DMA_Callback (int32_t);
static const SPI_DMA SPI0_Tx_DMA = { DMAREQ_SPI0_TX, &SPI0_TX_DMA_Callback };
static const SPI_DMA SPI0_Rx_DMA = { DMAREQ_SPI0_RX, &SPI0_RX_DMA_Callback };
#endif

#if defined(SPI0_SSEL_PORT)
static SPI_SSEL spi0_ssel = { SPI0_SSEL_PORT,
                              SPI0_SSEL_PIN,
                              SPI0_SSEL_FUNC,
                              SPI0_SSEL_NUM };
#endif

/* SPI0 Resources */
static SPI_RESOURCES SPI0_Resources = {
  LPC_SPI0,
  SPI0_IRQn,
  SPI0_SYSCON_CLOCK,
  { SPI0_MOSI_PORT, SPI0_MOSI_PIN, SPI0_MOSI_FUNC },
  { SPI0_MISO_PORT, SPI0_MISO_PIN, SPI0_MISO_FUNC },
  { SPI0_SCK_PORT,  SPI0_SCK_PIN,  SPI0_SCK_FUNC  },
  #if defined(SPI0_SSEL_PORT)
  &spi0_ssel,
  #else
  NULL,
  #endif
  #if defined (SPI0_DMA_EN)
  &SPI0_Tx_DMA,
  &SPI0_Rx_DMA,
  #else
  NULL,
  NULL,
  #endif
  &SPI0_Ctrl
};
#endif /* RTE_SPI0 */


#if (RTE_SPI1)
/* SPI1 Control Information */
static SPI_INFO SPI1_Ctrl = { 0 };

#if defined(SPI1_DMA_EN)
static       void    SPI1_TX_DMA_Callback (int32_t);
static       void    SPI1_RX_DMA_Callback (int32_t);
static const SPI_DMA SPI1_Tx_DMA = { DMAREQ_SPI1_TX, &SPI1_TX_DMA_Callback };
static const SPI_DMA SPI1_Rx_DMA = { DMAREQ_SPI1_RX, &SPI1_RX_DMA_Callback };
#endif

#if defined(SPI1_SSEL_PORT)
static SPI_SSEL spi1_ssel = { SPI1_SSEL_PORT,
                              SPI1_SSEL_PIN,
                              SPI1_SSEL_FUNC,
                              SPI1_SSEL_NUM };
#endif

/* SPI1 Resources */
static SPI_RESOURCES SPI1_Resources = {
  LPC_SPI1,
  SPI1_IRQn,
  SPI1_SYSCON_CLOCK,
  { SPI1_MOSI_PORT, SPI1_MOSI_PIN, SPI1_MOSI_FUNC },
  { SPI1_MISO_PORT, SPI1_MISO_PIN, SPI1_MISO_FUNC },
  { SPI1_SCK_PORT,  SPI1_SCK_PIN,  SPI1_SCK_FUNC  },
  #if defined(SPI1_SSEL_PORT)
  &spi1_ssel,
  #else
  NULL,
  #endif
  #if defined (SPI1_DMA_EN)
  &SPI1_Tx_DMA,
  &SPI1_Rx_DMA,
  #else
  NULL,
  NULL,
  #endif
  &SPI1_Ctrl
};
#endif /* RTE_SPI1 */


#if (RTE_SPI2)
/* SPI2 Control Information */
static SPI_INFO SPI2_Ctrl = { 0 };

#if defined(SPI2_DMA_EN)
static       void    SPI2_TX_DMA_Callback (int32_t);
static       void    SPI2_RX_DMA_Callback (int32_t);
static const SPI_DMA SPI2_Tx_DMA = { DMAREQ_SPI2_TX, &SPI2_TX_DMA_Callback };
static const SPI_DMA SPI2_Rx_DMA = { DMAREQ_SPI2_RX, &SPI2_RX_DMA_Callback };
#endif

#if defined(SPI2_SSEL_PORT)
static SPI_SSEL spi2_ssel = { SPI2_SSEL_PORT,
                              SPI2_SSEL_PIN,
                              SPI2_SSEL_FUNC,
                              SPI2_SSEL_NUM };
#endif

/* SPI2 Resources */
static SPI_RESOURCES SPI2_Resources = {
  LPC_SPI2,
  SPI2_IRQn,
  SPI2_SYSCON_CLOCK,
  { SPI2_MOSI_PORT, SPI2_MOSI_PIN, SPI2_MOSI_FUNC },
  { SPI2_MISO_PORT, SPI2_MISO_PIN, SPI2_MISO_FUNC },
  { SPI2_SCK_PORT,  SPI2_SCK_PIN,  SPI2_SCK_FUNC  },
  #if defined(SPI2_SSEL_PORT)
  &spi2_ssel,
  #else
  NULL,
  #endif
  #if defined (SPI2_DMA_EN)
  &SPI2_Tx_DMA,
  &SPI2_Rx_DMA,
  #else
  NULL,
  NULL,
  #endif
  &SPI2_Ctrl
};
#endif /* RTE_SPI2 */


#if (RTE_SPI3)
/* SPI3 Control Information */
static SPI_INFO SPI3_Ctrl = { 0 };

