qm2813518589/LPC54606_Library/.pack/Keil/LPC54000_DFP.2.6.0/RTE_Driver/SPI_LPC5411x.c
#if defined(SPI3_DMA_EN)
static       void    SPI3_TX_DMA_Callback (int32_t);
static       void    SPI3_RX_DMA_Callback (int32_t);
static const SPI_DMA SPI3_Tx_DMA = { DMAREQ_SPI3_TX, &SPI3_TX_DMA_Callback };
static const SPI_DMA SPI3_Rx_DMA = { DMAREQ_SPI3_RX, &SPI3_RX_DMA_Callback };
#endif

#if defined(SPI3_SSEL_PORT)
static SPI_SSEL spi3_ssel = { SPI3_SSEL_PORT,
                              SPI3_SSEL_PIN,
                              SPI3_SSEL_FUNC,
                              SPI3_SSEL_NUM };
#endif

/* SPI3 Resources */
static SPI_RESOURCES SPI3_Resources = {
  LPC_SPI3,
  SPI3_IRQn,
  SPI3_SYSCON_CLOCK,
  { SPI3_MOSI_PORT, SPI3_MOSI_PIN, SPI3_MOSI_FUNC },
  { SPI3_MISO_PORT, SPI3_MISO_PIN, SPI3_MISO_FUNC },
  { SPI3_SCK_PORT,  SPI3_SCK_PIN,  SPI3_SCK_FUNC  },
  #if defined(SPI3_SSEL_PORT)
  &spi3_ssel,
  #else
  NULL,
  #endif
  #if defined (SPI3_DMA_EN)
  &SPI3_Tx_DMA,
  &SPI3_Rx_DMA,
  #else
  NULL,
  NULL,
  #endif
  &SPI3_Ctrl
};
#endif /* RTE_SPI3 */


#if (RTE_SPI4)
/* SPI4 Control Information */
static SPI_INFO SPI4_Ctrl = { 0 };

#if defined(SPI4_DMA_EN)
static       void    SPI4_TX_DMA_Callback (int32_t);
static       void    SPI4_RX_DMA_Callback (int32_t);
static const SPI_DMA SPI4_Tx_DMA = { DMAREQ_SPI4_TX, &SPI4_TX_DMA_Callback };
static const SPI_DMA SPI4_Rx_DMA = { DMAREQ_SPI4_RX, &SPI4_RX_DMA_Callback };
#endif

#if defined(SPI4_SSEL_PORT)
static SPI_SSEL spi4_ssel = { SPI4_SSEL_PORT,
                              SPI4_SSEL_PIN,
                              SPI4_SSEL_FUNC,
                              SPI4_SSEL_NUM };
#endif

/* SPI4 Resources */
static SPI_RESOURCES SPI4_Resources = {
  LPC_SPI4,
  SPI4_IRQn,
  SPI4_SYSCON_CLOCK,
  { SPI4_MOSI_PORT, SPI4_MOSI_PIN, SPI4_MOSI_FUNC },
  { SPI4_MISO_PORT, SPI4_MISO_PIN, SPI4_MISO_FUNC },
  { SPI4_SCK_PORT,  SPI4_SCK_PIN,  SPI4_SCK_FUNC  },
  #if defined(SPI4_SSEL_PORT)
  &spi4_ssel,
  #else
  NULL,
  #endif
  #if defined (SPI4_DMA_EN)
  &SPI4_Tx_DMA,
  &SPI4_Rx_DMA,
  #else
  NULL,
  NULL,
  #endif
  &SPI4_Ctrl
};
#endif /* RTE_SPI4 */


#if (RTE_SPI5)
/* SPI5 Control Information */
static SPI_INFO SPI5_Ctrl = { 0 };

#if defined(SPI5_DMA_EN)
static       void    SPI5_TX_DMA_Callback (int32_t);
static       void    SPI5_RX_DMA_Callback (int32_t);
static const SPI_DMA SPI5_Tx_DMA = { DMAREQ_SPI5_TX, &SPI5_TX_DMA_Callback };
static const SPI_DMA SPI5_Rx_DMA = { DMAREQ_SPI5_RX, &SPI5_RX_DMA_Callback };
#endif

#if defined(SPI5_SSEL_PORT)
static SPI_SSEL spi5_ssel = { SPI5_SSEL_PORT,
                              SPI5_SSEL_PIN,
                              SPI5_SSEL_FUNC,
                              SPI5_SSEL_NUM };
#endif

/* SPI5 Resources */
static SPI_RESOURCES SPI5_Resources = {
  LPC_SPI5,
  SPI5_IRQn,
  SPI5_SYSCON_CLOCK,
  { SPI5_MOSI_PORT, SPI5_MOSI_PIN, SPI5_MOSI_FUNC },
  { SPI5_MISO_PORT, SPI5_MISO_PIN, SPI5_MISO_FUNC },
  { SPI5_SCK_PORT,  SPI5_SCK_PIN,  SPI5_SCK_FUNC  },
  #if defined(SPI5_SSEL_PORT)
  &spi5_ssel,
  #else
  NULL,
  #endif
  #if defined (SPI5_DMA_EN)
  &SPI5_Tx_DMA,
  &SPI5_Rx_DMA,
  #else
  NULL,
  NULL,
  #endif
  &SPI5_Ctrl
};
#endif /* RTE_SPI5 */


#if (RTE_SPI6)
/* SPI6 Control Information */
static SPI_INFO SPI6_Ctrl = { 0 };

#if defined(SPI6_DMA_EN)
static       void    SPI6_TX_DMA_Callback (int32_t);
static       void    SPI6_RX_DMA_Callback (int32_t);
static const SPI_DMA SPI6_Tx_DMA = { DMAREQ_SPI6_TX, &SPI6_TX_DMA_Callback };
static const SPI_DMA SPI6_Rx_DMA = { DMAREQ_SPI6_RX, &SPI6_RX_DMA_Callback };
#endif

#if defined(SPI6_SSEL_PORT)
static SPI_SSEL spi6_ssel = { SPI6_SSEL_PORT,
                              SPI6_SSEL_PIN,
                              SPI6_SSEL_FUNC,
                              SPI6_SSEL_NUM };
#endif

/* SPI6 Resources */
static SPI_RESOURCES SPI6_Resources = {
  LPC_SPI6,
  SPI6_IRQn,
  SPI6_SYSCON_CLOCK,
  { SPI6_MOSI_PORT, SPI6_MOSI_PIN, SPI6_MOSI_FUNC },
  { SPI6_MISO_PORT, SPI6_MISO_PIN, SPI6_MISO_FUNC },
  { SPI6_SCK_PORT,  SPI6_SCK_PIN,  SPI6_SCK_FUNC  },
  #if defined(SPI6_SSEL_PORT)
  &spi6_ssel,
  #else
  NULL,
  #endif
  #if defined (SPI6_DMA_EN)
  &SPI6_Tx_DMA,
  &SPI6_Rx_DMA,
  #else
  NULL,
  NULL,
  #endif
  &SPI6_Ctrl
};
#endif /* RTE_SPI6 */


#if (RTE_SPI7)
/* SPI7 Control Information */
static SPI_INFO SPI7_Ctrl = { 0 };

#if defined(SPI7_DMA_EN)
static       void    SPI7_TX_DMA_Callback (int32_t);
static       void    SPI7_RX_DMA_Callback (int32_t);
static const SPI_DMA SPI7_Tx_DMA = { DMAREQ_SPI7_TX, &SPI7_TX_DMA_Callback };
static const SPI_DMA SPI7_Rx_DMA = { DMAREQ_SPI7_RX, &SPI7_RX_DMA_Callback };
#endif

#if defined(SPI7_SSEL_PORT)
static SPI_SSEL spi7_ssel = { SPI7_SSEL_PORT,
                              SPI7_SSEL_PIN,
                              SPI7_SSEL_FUNC,
                              SPI7_SSEL_NUM };
#endif

/* SPI7 Resources */
static SPI_RESOURCES SPI7_Resources = {
  LPC_SPI7,
  SPI7_IRQn,
  SPI7_SYSCON_CLOCK,
  { SPI7_MOSI_PORT, SPI7_MOSI_PIN, SPI7_MOSI_FUNC },
  { SPI7_MISO_PORT, SPI7_MISO_PIN, SPI7_MISO_FUNC },
  { SPI7_SCK_PORT,  SPI7_SCK_PIN,  SPI7_SCK_FUNC  },
  #if defined(SPI7_SSEL_PORT)
  &spi7_ssel,
  #else
  NULL,
  #endif
  #if defined (SPI7_DMA_EN)
  &SPI7_Tx_DMA,
  &SPI7_Rx_DMA,
  #else
  NULL,
  NULL,
  #endif
  &SPI7_Ctrl
};
#endif /* RTE_SPI7 */


/**
  \fn          ARM_DRIVER_VERSION SPI_GetVersion (void)
  \brief       Get SPI driver version.
  \return      \ref ARM_DRV_VERSION
*/
static ARM_DRIVER_VERSION SPI_GetVersion (void) {
  return DriverVersion;
}


/**
  \fn          ARM_SPI_CAPABILITIES SPI_GetCapabilities (void)
  \brief       Get driver capabilities.
  \return      \ref ARM_SPI_CAPABILITIES
*/
static ARM_SPI_CAPABILITIES SPI_GetCapabilities (void) {
  return DriverCapabilities;
}


/**
  \fn          int32_t SPI_Initialize (ARM_SPI_SignalEvent_t cb_event, const SPI_RESOURCES *spi)
  \brief       Initialize SPI Interface.
  \param[in]   cb_event  Pointer to \ref ARM_SPI_SignalEvent
  \param[in]   spi       Pointer to SPI resources
  \return      \ref execution_status
*/
static int32_t SPI_Initialize (ARM_SPI_SignalEvent_t cb_event, const SPI_RESOURCES *spi) {
#if defined(SPI_DMA_ENABLE)
  DMA_PERIPHERAL_CONTEXT_T dma_context;
#endif

  if (spi->info->flags & SPI_INIT)  { return ARM_DRIVER_OK; }

  /* Enable power */
  Chip_Clock_EnablePeriphClock (SYSCON_CLOCK_IOCON);
  Chip_Clock_EnablePeriphClock (SYSCON_CLOCK_GPIO0);
  Chip_Clock_EnablePeriphClock (SYSCON_CLOCK_GPIO1);

