qm2813518589/LPC54606_Library/.pack/Keil/LPC54000_DFP.2.6.0/RTE_Driver/SPI_LPC5411x.c
  /* Configure SPI pins */
  Chip_IOCON_PinMuxSet (LPC_IOCON, spi->mosi.port, spi->mosi.pin, spi->mosi.func | SPI_PIN_IOCON);
  Chip_IOCON_PinMuxSet (LPC_IOCON, spi->miso.port, spi->miso.pin, spi->miso.func | SPI_PIN_IOCON);
  Chip_IOCON_PinMuxSet (LPC_IOCON, spi->sck.port,  spi->sck.pin,  spi->sck.func  | SPI_PIN_IOCON);

#if defined(SPI_DMA_ENABLE)
  if ((spi->dma_rx != NULL) && (spi->dma_tx != NULL)) {
    if ((LPC_SYSCON->AHBCLKCTRL[0] & SYSCON_CLOCK_DMA) == 0) {
      /* DMA clock is disabled, init DMA service */
      Chip_DMASERVICE_Init (Chip_DMA_Table);
    }

    /* Enable DMA IRQ in NVIC */
    NVIC_EnableIRQ(DMA_IRQn);

    /* Configure transmit channel */
    Chip_DMA_EnableChannel     (LPC_DMA, spi->dma_tx->ch);
    Chip_DMA_EnableIntChannel  (LPC_DMA, spi->dma_tx->ch);
    Chip_DMA_SetupChannelConfig(LPC_DMA, spi->dma_tx->ch, DMA_CFG_PERIPHREQEN);

    dma_context.channel = spi->dma_tx->ch;
    Chip_DMASERVICE_RegisterCb (&dma_context, spi->dma_tx->callback);

    /* Configure receive channel */
    Chip_DMA_EnableChannel     (LPC_DMA, spi->dma_rx->ch);
    Chip_DMA_EnableIntChannel  (LPC_DMA, spi->dma_rx->ch);
    Chip_DMA_SetupChannelConfig(LPC_DMA, spi->dma_rx->ch, DMA_CFG_PERIPHREQEN);

    dma_context.channel = spi->dma_rx->ch;
    Chip_DMASERVICE_RegisterCb (&dma_context, spi->dma_rx->callback);
  }
#endif

  /* Reset Run-Time information structure */
  memset (spi->info, 0x00, sizeof (SPI_INFO));

  spi->info->cb_event = cb_event;
  spi->info->flags    = SPI_INIT;

  return ARM_DRIVER_OK;
}


/**
  \fn          int32_t SPI_Uninitialize (const SPI_RESOURCES *spi)
  \brief       De-initialize SPI Interface.
  \param[in]   spi  Pointer to SPI resources
  \return      \ref execution_status
*/
static int32_t SPI_Uninitialize (const SPI_RESOURCES *spi) {

  spi->info->flags = 0U;
  
  /* Reset SPI pins */
  Chip_IOCON_PinMuxSet (LPC_IOCON, spi->mosi.port, spi->mosi.pin, SPI_PIN_IOCON_RESET);
  Chip_IOCON_PinMuxSet (LPC_IOCON, spi->miso.port, spi->miso.pin, SPI_PIN_IOCON_RESET);
  Chip_IOCON_PinMuxSet (LPC_IOCON, spi->sck.port,  spi->sck.pin,  SPI_PIN_IOCON_RESET);

  if (spi->ssel) {
    Chip_IOCON_PinMuxSet (LPC_IOCON, spi->ssel->port, spi->ssel->pin, SPI_PIN_IOCON_RESET);
  }

  return ARM_DRIVER_OK;
}


/**
  \fn          int32_t SPI_PowerControl (ARM_POWER_STATE state,
                                         const SPI_RESOURCES *spi)
  \brief       Control SPI Interface Power.
  \param[in]   state  Power state
  \param[in]   spi    Pointer to SPI resources
  \return      \ref execution_status
*/
static int32_t SPI_PowerControl (ARM_POWER_STATE state, const SPI_RESOURCES *spi) {

  switch (state) {
    case ARM_POWER_OFF:
      /* Power off SPI peripheral */
      NVIC_DisableIRQ (spi->irqn);

      /* Init peripheral (enable clock + reset) */
      Chip_SPI_Init (spi->reg);

      /* Deinit peripheral */
      Chip_SPI_DeInit (spi->reg);

      /* Reset status */
      spi->info->status.busy       = 0U;
      spi->info->status.data_lost  = 0U;

      spi->info->flags  &= ~SPI_POWER;
      break;

    case ARM_POWER_FULL:
      if ((spi->info->flags & SPI_INIT)  == 0U) { return ARM_DRIVER_ERROR; }
      if ((spi->info->flags & SPI_POWER) != 0U) { return ARM_DRIVER_OK; }

      /* Init peripheral (enable clock + reset) */
      Chip_SPI_Init (spi->reg);

      /* Set PLL as SPI clock source */
      Chip_Clock_SetFLEXCOMMClockSource(Chip_FLEXCOMM_GetIndex (spi->reg), SYSCON_FLEXCOMMCLKSELSRC_PLL);

      /* Reset status */
      spi->info->status.busy       = 0U;
      spi->info->status.data_lost  = 0U;

      if ((spi->dma_rx != NULL) && (spi->dma_tx != NULL)) {
        spi->info->flags |= SPI_XFER_DMA;
      }

      /* Enable FIFO Tx and Rx level trigger */
      spi->reg->FIFOTRIG |= SPI_FIFOTRIG_TXLVLENA | SPI_FIFOTRIG_RXLVLENA;

      /* Enable SPI interrupts */
      Chip_SPI_EnableFIFOInts (spi->reg, SPI_FIFOINT_TXERR | SPI_FIFOINT_RXERR);

      if (spi->info->flags & SPI_XFER_DMA) {
        /* Enable DMA for transmit function */
        Chip_SPI_SetFIFOCfg(spi->reg, SPI_FIFOCFG_DMATX | SPI_FIFOCFG_DMARX);
      } else {
        /* Interrupt data transfer */
        Chip_SPI_EnableFIFOInts (spi->reg, SPI_FIFOINT_RXLVL);
      }

      /* Enable peripheral interrupts in NVIC */
      NVIC_ClearPendingIRQ (spi->irqn);
      NVIC_EnableIRQ       (spi->irqn);

      spi->info->flags |= SPI_POWER;
      break;

    default:
      return ARM_DRIVER_ERROR_UNSUPPORTED;
  }

  return ARM_DRIVER_OK;
}

/**
  \fn          int32_t SPI_Send (const void *data, uint32_t num, const SPI_RESOURCES *spi)
  \brief       Start sending data to SPI transmitter.
  \param[in]   data  Pointer to buffer with data to send to SPI transmitter
  \param[in]   num   Number of data items to send
  \param[in]   spi   Pointer to SPI resources
  \return      \ref execution_status
*/
static int32_t SPI_Send (const void *data, uint32_t num, const SPI_RESOURCES *spi) {
#if defined(SPI_DMA_ENABLE)
  DMA_PERIPHERAL_CONTEXT_T dma_context;
#endif

  if ((data == NULL) || (num == 0U))        { return ARM_DRIVER_ERROR_PARAMETER; }
  if ((spi->info->flags & SPI_SETUP) == 0U) { return ARM_DRIVER_ERROR; }
  if ( spi->info->status.busy)              { return ARM_DRIVER_ERROR_BUSY; }

  spi->info->status.busy      = 1U;
  spi->info->status.data_lost = 0U;

  spi->info->xfer.rx_buf = NULL;
  spi->info->xfer.tx_buf = (uint8_t *)data;
  spi->info->xfer.num    = num;
  spi->info->xfer.rx_cnt = 0U;
  spi->info->xfer.tx_cnt = 0U;

#if defined(SPI_DMA_ENABLE)
  if (spi->info->flags & SPI_XFER_DMA) {
    if (num > 1024U) { num = 1024U; }

    spi->info->xfer.rx_pend = num;
    spi->info->xfer.tx_pend = num;
    spi->info->xfer.ctrl    = (DMA_XFERCFG_DSTINC_0 | DMA_XFERCFG_SRCINC_0) << 16 |
                              (DMA_XFERCFG_DSTINC_0 | DMA_XFERCFG_SRCINC_1);

    spi->info->xfer.rx_buf  = (uint8_t *)&spi->info->xfer.dummy;

    if (spi->info->flags & SPI_16B_FRAME) {
      dma_context.width     = DMA_XFERCFG_WIDTH_16;
      num *= 2;
    } else {
      dma_context.width     = DMA_XFERCFG_WIDTH_8;
    }

    /* Configure receive channel */
    dma_context.channel           = spi->dma_rx->ch;
    dma_context.register_location = (volatile uint32_t *)&(spi->reg->FIFORD);
    dma_context.dst_increment     = DMA_XFERCFG_DSTINC_0;
    dma_context.src_increment     = DMA_XFERCFG_SRCINC_0;
    dma_context.write             = false;

