qm2813518589/LPC54606_Library/.pack/Keil/LPC54000_DFP.2.6.0/RTE_Driver/SPI_LPC5411x.c
    Chip_DMASERVICE_SingleBuffer (&dma_context, (uint32_t)spi->info->xfer.rx_buf, num);

    /* Configure transmit channel */
    dma_context.channel           = spi->dma_tx->ch;
    dma_context.register_location = (volatile uint32_t *)&(spi->reg->FIFOWR);
    dma_context.dst_increment     = DMA_XFERCFG_DSTINC_0;
    dma_context.src_increment     = DMA_XFERCFG_SRCINC_1;
    dma_context.write             = true;

    Chip_DMASERVICE_SingleBuffer (&dma_context, (uint32_t)spi->info->xfer.tx_buf, num);
  } else
#endif
  {
    /* Enable TX FIFO level interrupt */
    Chip_SPI_EnableFIFOInts (spi->reg, SPI_FIFOINT_TXLVL);
  }

  return ARM_DRIVER_OK;
}


/**
  \fn          int32_t SPI_Receive (void *data, uint32_t num, const SPI_RESOURCES *spi)
  \brief       Start receiving data from SPI receiver.
  \param[out]  data  Pointer to buffer for data to receive from SPI receiver
  \param[in]   num   Number of data items to receive
  \param[in]   spi   Pointer to SPI resources
  \return      \ref execution_status
*/
static int32_t SPI_Receive (void *data, uint32_t num, const SPI_RESOURCES *spi) {
#if defined(SPI_DMA_ENABLE)
  DMA_PERIPHERAL_CONTEXT_T dma_context;
#endif

  if ((data == NULL) || (num == 0U))        { return ARM_DRIVER_ERROR_PARAMETER; }
  if ((spi->info->flags & SPI_SETUP) == 0U) { return ARM_DRIVER_ERROR; }
  if ( spi->info->status.busy)              { return ARM_DRIVER_ERROR_BUSY; }

  spi->info->status.busy       = 1U;
  spi->info->status.data_lost  = 0U;

  spi->info->xfer.rx_buf = (uint8_t *)data;
  spi->info->xfer.tx_buf = NULL;
  spi->info->xfer.num    = num;
  spi->info->xfer.rx_cnt = 0U;
  spi->info->xfer.tx_cnt = 0U;

#if defined(SPI_DMA_ENABLE)
  if (spi->info->flags & SPI_XFER_DMA) {
    if (num > 1024U) { num = 1024U; }

    spi->info->xfer.rx_pend = num;
    spi->info->xfer.tx_pend = num;
    spi->info->xfer.ctrl    = (DMA_XFERCFG_DSTINC_1 | DMA_XFERCFG_SRCINC_0) << 16 |
                              (DMA_XFERCFG_DSTINC_0 | DMA_XFERCFG_SRCINC_0);

    spi->info->xfer.tx_buf  = (uint8_t *)&spi->info->xfer.def_val;

    if (spi->info->flags & SPI_16B_FRAME) {
      dma_context.width     = DMA_XFERCFG_WIDTH_16;
      num *= 2;
    } else {
      dma_context.width     = DMA_XFERCFG_WIDTH_8;
    }

    /* Configure receive channel */
    dma_context.channel           = spi->dma_rx->ch;
    dma_context.register_location = (volatile uint32_t *)&(spi->reg->FIFORD);
    dma_context.dst_increment     = DMA_XFERCFG_DSTINC_1;
    dma_context.src_increment     = DMA_XFERCFG_SRCINC_0;
    dma_context.write             = false;

    Chip_DMASERVICE_SingleBuffer (&dma_context, (uint32_t)spi->info->xfer.rx_buf, num);

    /* Configure transmit channel */
    dma_context.channel           = spi->dma_tx->ch;
    dma_context.register_location = (volatile uint32_t *)&(spi->reg->FIFOWR);
    dma_context.dst_increment     = DMA_XFERCFG_DSTINC_0;
    dma_context.src_increment     = DMA_XFERCFG_SRCINC_0;
    dma_context.write             = true;

    Chip_DMASERVICE_SingleBuffer (&dma_context, (uint32_t)spi->info->xfer.tx_buf, num);
  } else
#endif
  {
    /* Enable TX FIFO level interrupt */
    Chip_SPI_EnableFIFOInts (spi->reg, SPI_FIFOINT_TXLVL);
  }

  return ARM_DRIVER_OK;
}


/**
  \fn          int32_t SPI_Transfer (const void *data_out, void *data_in, uint32_t num, const SPI_RESOURCES *spi)
  \brief       Start sending/receiving data to/from SPI transmitter/receiver.
  \param[in]   data_out  Pointer to buffer with data to send to SPI transmitter
  \param[out]  data_in   Pointer to buffer for data to receive from SPI receiver
  \param[in]   num       Number of data items to transfer
  \param[in]   spi       Pointer to SPI resources
  \return      \ref execution_status
*/
static int32_t SPI_Transfer (const void *data_out, void *data_in, uint32_t num, const SPI_RESOURCES *spi) {
#if defined(SPI_DMA_ENABLE)
  DMA_PERIPHERAL_CONTEXT_T dma_context;
#endif

  if ((data_out == NULL) || (data_in == NULL) || (num == 0U)) { return ARM_DRIVER_ERROR_PARAMETER; }
  if ((spi->info->flags & SPI_SETUP) == 0U)                   { return ARM_DRIVER_ERROR; }
  if ( spi->info->status.busy)                                { return ARM_DRIVER_ERROR_BUSY; }

  spi->info->status.busy       = 1U;
  spi->info->status.data_lost  = 0U;

  spi->info->xfer.rx_buf = (uint8_t *)data_in;
  spi->info->xfer.tx_buf = (uint8_t *)data_out;

  spi->info->xfer.num    = num;
  spi->info->xfer.rx_cnt = 0U;
  spi->info->xfer.tx_cnt = 0U;

#if defined(SPI_DMA_ENABLE)
  if (spi->info->flags & SPI_XFER_DMA) {
    if (num > 1024U) { num = 1024U; }

    spi->info->xfer.rx_pend = num;
    spi->info->xfer.tx_pend = num;
    spi->info->xfer.ctrl    = (DMA_XFERCFG_DSTINC_1 | DMA_XFERCFG_SRCINC_0) << 16 |
                              (DMA_XFERCFG_DSTINC_0 | DMA_XFERCFG_SRCINC_1);

    if (spi->info->flags & SPI_16B_FRAME) {
      dma_context.width     = DMA_XFERCFG_WIDTH_16;
      num *= 2;
    } else {
      dma_context.width     = DMA_XFERCFG_WIDTH_8;
    }

    /* Configure receive channel */
    dma_context.channel           = spi->dma_rx->ch;
    dma_context.register_location = (volatile uint32_t *)&(spi->reg->FIFORD);
    dma_context.dst_increment     = DMA_XFERCFG_DSTINC_1;
    dma_context.src_increment     = DMA_XFERCFG_SRCINC_0;
    dma_context.write             = false;

    Chip_DMASERVICE_SingleBuffer (&dma_context, (uint32_t)spi->info->xfer.rx_buf, num);

    /* Configure transmit channel */
    dma_context.channel           = spi->dma_tx->ch;
    dma_context.register_location = (volatile uint32_t *)&(spi->reg->FIFOWR);
    dma_context.dst_increment     = DMA_XFERCFG_DSTINC_0;
    dma_context.src_increment     = DMA_XFERCFG_SRCINC_1;
    dma_context.write             = true;

    Chip_DMASERVICE_SingleBuffer (&dma_context, (uint32_t)spi->info->xfer.tx_buf, num);
  } else
#endif
  {
    /* Enable TX FIFO level interrupt */
    Chip_SPI_EnableFIFOInts (spi->reg, SPI_FIFOINT_TXLVL);
  }

  return ARM_DRIVER_OK;
}


/**
  \fn          uint32_t SPI_GetDataCount (const SPI_RESOURCES *spi)
  \brief       Get transferred data count.
  \param[in]   spi  Pointer to SPI resources
  \return      number of data items transferred
*/
static uint32_t SPI_GetDataCount (const SPI_RESOURCES *spi) {
  return (spi->info->xfer.rx_cnt);
}


/**
  \fn          int32_t SPI_Control (uint32_t control, uint32_t arg, const SPI_RESOURCES *spi)
  \brief       Control SPI Interface.
  \param[in]   control  operation
  \param[in]   arg      argument of operation (optional)
  \param[in]   spi      Pointer to SPI resources
  \return      \ref execution_status
*/
static int32_t SPI_Control (uint32_t control, uint32_t arg, const SPI_RESOURCES *spi) {
  uint32_t bits;

  if ((spi->info->flags & SPI_POWER) == 0U) { return ARM_DRIVER_ERROR; }

