qm2813518589/LPC54606_Library/.pack/Keil/LPC54000_DFP.2.6.0/RTE_Driver/SPI_LPC5411x.c
  if ((control & ARM_SPI_CONTROL_Msk) == ARM_SPI_ABORT_TRANSFER) {
    /* Abort data transfer */
    Chip_SPI_ClearCFGRegBits (spi->reg, SPI_CFG_SPI_EN);
    Chip_SPI_SetCFGRegBits   (spi->reg, SPI_CFG_SPI_EN);

    spi->info->xfer.num    = 0U;
    spi->info->xfer.rx_cnt = 0U;
    spi->info->xfer.tx_cnt = 0U;
    spi->info->status.busy = 0U;

    return ARM_DRIVER_OK;
  }

  if (spi->info->status.busy) { return ARM_DRIVER_ERROR_BUSY; }

  switch (control & ARM_SPI_CONTROL_Msk) {
    case ARM_SPI_MODE_INACTIVE:             // SPI Inactive
      Chip_SPI_Disable (spi->reg);
      /* Clear configured flag */
      spi->info->flags &= ~SPI_SETUP;
      return ARM_DRIVER_OK;

    case ARM_SPI_MODE_MASTER:               // SPI Master (Output on MOSI, Input on MISO); arg = Bus Speed in bps
    case ARM_SPI_MODE_SLAVE:                // SPI Slave  (Output on MISO, Input on MOSI)
      break;

    case ARM_SPI_MODE_MASTER_SIMPLEX:       // SPI Master (Output/Input on MOSI); arg = Bus Speed in bps
    case ARM_SPI_MODE_SLAVE_SIMPLEX:        // SPI Slave  (Output/Input on MISO)
      return ARM_SPI_ERROR_MODE;

    case ARM_SPI_SET_BUS_SPEED:             // Set Bus Speed in bps; arg = value
      Chip_SPIM_SetClockRate (spi->reg, arg);
      return ARM_DRIVER_OK;

    case ARM_SPI_GET_BUS_SPEED:             // Get Bus Speed in bps
      return (Chip_SPIM_GetClockRate(spi->reg));

    case ARM_SPI_SET_DEFAULT_TX_VALUE:      // Set default Transmit value; arg = value
      spi->info->xfer.def_val = arg;
      return ARM_DRIVER_OK;

    case ARM_SPI_CONTROL_SS:                // Control Slave Select; arg = 0:inactive, 1:active
      if (spi->info->flags & SPI_SS_SWCTRL) {
        if (arg == ARM_SPI_SS_INACTIVE) {
          Chip_GPIO_SetPinState (LPC_GPIO, spi->ssel->port, spi->ssel->pin, true);
        } else {
          Chip_GPIO_SetPinState (LPC_GPIO, spi->ssel->port, spi->ssel->pin, false);
        }
        return ARM_DRIVER_OK;
      }
      return ARM_DRIVER_ERROR;

    default:
      return ARM_DRIVER_ERROR_UNSUPPORTED;
  }

  /* Configure mode */
  Chip_SPI_Disable (spi->reg);

  if ((control & ARM_SPI_CONTROL_Msk) == ARM_SPI_MODE_MASTER) {
    /* Enable master mode */
    Chip_SPI_SetCFGRegBits (spi->reg, SPI_CFG_MASTER_EN);

    /* Set SCK frequency */
    Chip_SPIM_SetClockRate (spi->reg, arg);

    if (spi->info->flags & SPI_XFER_DMA) {
      SPI_FIFOCTRL(spi->reg) |= 0x0F;
      SPI_FIFOCTRL(spi->reg) &= ~(1 << spi->ssel->num);
    } else {
      spi->info->xfer.ctrl = (0x000F & ~(1 << spi->ssel->num)) << 16;
    }
  } else {
    /* Enable slave mode */
    Chip_SPI_ClearCFGRegBits(spi->reg, SPI_CFG_MASTER_EN);
  }

  if ((control & ARM_SPI_CONTROL_Msk) == ARM_SPI_MODE_MASTER) {
    switch (control & ARM_SPI_SS_MASTER_MODE_Msk) {
      case ARM_SPI_SS_MASTER_UNUSED:        // SPI Slave Select when Master: Not used (default)
        if (spi->ssel != NULL) {
          Chip_IOCON_PinMuxSet (LPC_IOCON, spi->ssel->port, spi->ssel->pin, SPI_PIN_IOCON_RESET);
        }
        spi->info->flags &= ~SPI_SS_SWCTRL;
        break;

      case ARM_SPI_SS_MASTER_HW_INPUT:      // SPI Slave Select when Master: Hardware monitored Input
        return ARM_SPI_ERROR_SS_MODE;

      case ARM_SPI_SS_MASTER_SW:            // SPI Slave Select when Master: Software controlled
        if (spi->ssel == NULL) {
          return ARM_SPI_ERROR_SS_MODE;
        }
        spi->info->flags |= SPI_SS_SWCTRL;

        Chip_IOCON_PinMuxSet (LPC_IOCON, spi->ssel->port, spi->ssel->pin, SPI_PIN_IOCON);
        /* Configure SSEL pin as high output */
        Chip_GPIO_SetPinState    (LPC_GPIO, spi->ssel->port, spi->ssel->pin, true);
        Chip_GPIO_SetPinDIROutput(LPC_GPIO, spi->ssel->port, spi->ssel->pin);
        break;

      case ARM_SPI_SS_MASTER_HW_OUTPUT:     // SPI Slave Select when Master: Hardware controlled Output
        if (spi->ssel == NULL) {
          return ARM_SPI_ERROR_SS_MODE;
        }
        spi->info->flags &= ~SPI_SS_SWCTRL;

        Chip_IOCON_PinMuxSet (LPC_IOCON, spi->ssel->port, spi->ssel->pin, spi->ssel->func | SPI_PIN_IOCON);
        break;

      default:
        return ARM_SPI_ERROR_SS_MODE;
    }
  }

  if ((control & ARM_SPI_CONTROL_Msk) == ARM_SPI_MODE_SLAVE) {
    switch (control & ARM_SPI_SS_SLAVE_MODE_Msk) {
      case ARM_SPI_SS_SLAVE_HW:             // SPI Slave Select when Slave: Hardware monitored (default)
        if (spi->ssel == NULL) {
          return ARM_SPI_ERROR_SS_MODE;
        }
        Chip_IOCON_PinMuxSet (LPC_IOCON, spi->ssel->port, spi->ssel->pin, spi->ssel->func | SPI_PIN_IOCON);
        break;

      case ARM_SPI_SS_SLAVE_SW:             // SPI Slave Select when Slave: Software controlled
      default:
        return ARM_SPI_ERROR_SS_MODE;
    }
  }

  /* Configure Frame Format */
  switch (control & ARM_SPI_FRAME_FORMAT_Msk) {
    case ARM_SPI_CPOL0_CPHA0:
      Chip_SPI_SetSPIMode (spi->reg, SPI_CLOCK_CPHA0_CPOL0);
      break;

    case ARM_SPI_CPOL0_CPHA1:
      Chip_SPI_SetSPIMode (spi->reg, SPI_CLOCK_CPHA1_CPOL0);
      break;

    case ARM_SPI_CPOL1_CPHA0:
      Chip_SPI_SetSPIMode (spi->reg, SPI_CLOCK_CPHA0_CPOL1);
      break;

    case ARM_SPI_CPOL1_CPHA1:
      Chip_SPI_SetSPIMode (spi->reg, SPI_CLOCK_CPHA1_CPOL1);
      break;

    case ARM_SPI_TI_SSI:
    case ARM_SPI_MICROWIRE:
    default:
      return ARM_SPI_ERROR_FRAME_FORMAT;
  }

  /* Configure Number of Data Bits */
  bits = ((control & ARM_SPI_DATA_BITS_Msk) >> ARM_SPI_DATA_BITS_Pos);
  
  if (bits > 16U) {
    return ARM_SPI_ERROR_DATA_BITS;
  }
  else {
    if (bits > 8U) {
      spi->info->flags |= SPI_16B_FRAME;
    } else {
      spi->info->flags &= ~SPI_16B_FRAME;
    }
  }

  if (spi->info->flags & SPI_XFER_DMA) {
    SPI_FIFOCTRL(spi->reg) = (SPI_FIFOCTRL(spi->reg) & ~0x0F00UL) | ((bits - 1) << 8);
  } else {
    spi->info->xfer.ctrl &= ~(0x0FUL << 24);
    spi->info->xfer.ctrl |= ((bits - 1) << 24);
  }

  /* Configure Bit Order */
  if ((control & ARM_SPI_BIT_ORDER_Msk) == ARM_SPI_LSB_MSB) {
    Chip_SPI_EnableLSBFirst (spi->reg);
  } else {
    Chip_SPI_EnableMSBFirst (spi->reg);
  }

  Chip_SPI_Enable (spi->reg);

  spi->info->flags |= SPI_SETUP;

  return ARM_DRIVER_OK;

