qm2813518589/LPC54606_Library/.pack/Keil/LPC54000_DFP.2.6.0/RTE_Driver/SPI_LPC5411x.c
}


/**
  \fn          ARM_SPI_STATUS SPI_GetStatus (const SPI_RESOURCES *spi)
  \brief       Get SPI status.
  \param[in]   spi  Pointer to SPI resources
  \return      SPI status \ref ARM_SPI_STATUS
*/
static ARM_SPI_STATUS SPI_GetStatus (const SPI_RESOURCES *spi) {
  ARM_SPI_STATUS status;

  status.busy       = spi->info->status.busy;
  status.data_lost  = spi->info->status.data_lost;
  status.mode_fault = 0U;

  return (status);
}


/**
  \fn          void SPI_IRQHandler (SPI_RESOURCES *spi)
  \brief       SPI Interrupt handler.
  \param[in]   spi  Pointer to SPI resources
*/
void SPI_IRQHandler (const SPI_RESOURCES *spi) {
  SPI_TRANSFER_INFO *tr = &spi->info->xfer;
  uint32_t event;
  uint32_t mask;
  uint32_t stat;
  uint32_t data;

  event = 0U;
  mask  = 0U;
  stat  = Chip_SPI_GetFIFOStatus (spi->reg);

  if (stat & (SPI_FIFOSTAT_RXERR | SPI_FIFOSTAT_TXERR)) {
    if (stat & SPI_FIFOSTAT_RXERR) {
      /* Receiver overrun */
      Chip_SPI_ClearFIFOStatus (spi->reg, SPI_FIFOSTAT_RXERR);
    } else {
      /* Transmitter underfun */
      Chip_SPI_ClearFIFOStatus (spi->reg, SPI_FIFOSTAT_TXERR);
    }

    spi->info->status.data_lost = 1U;
    event |= ARM_SPI_EVENT_DATA_LOST;
  }

  if (tr->num > 0U) {
    data = Chip_SPI_GetFIFOEnabledInts(spi->reg);

    if (data & SPI_FIFOINT_TXLVL) {
      /* Tx interrupts are enabled */
      mask |= SPI_FIFOSTAT_TXNOTFULL;
    }
    if (data & SPI_FIFOINT_RXLVL) {
      /* Rx interrupts are enabled */
      mask |= SPI_FIFOSTAT_RXNOTEMPTY;
    }
  }

  if (stat & mask) {
    /* Transfer data is set */
    do {
      if (mask & SPI_FIFOSTAT_RXNOTEMPTY) {
        /* Rx interrupts are enabled */
        if (stat & SPI_FIFOSTAT_RXNOTEMPTY) {
          data = Chip_SPI_ReadRawRXFifo (spi->reg);

          if (tr->rx_cnt < tr->num) {
            if (tr->rx_buf) {
              *(tr->rx_buf++) = (uint8_t)data;

              if (spi->info->flags & SPI_16B_FRAME) {
                *(tr->rx_buf++) = (uint8_t)(data >> 8);
              }
            }
            tr->rx_cnt++;
          }
          else {
            /* All data received */
            mask &= ~SPI_FIFOSTAT_RXNOTEMPTY;
          }
        }
      }
      if (mask & SPI_FIFOSTAT_TXNOTFULL) {
        /* Tx interrupts are enabled */
        if (stat & SPI_FIFOSTAT_TXNOTFULL) {
          if (tr->tx_cnt < tr->num) {
            if (tr->tx_buf) {
              data = *tr->tx_buf++;

              if (spi->info->flags & SPI_16B_FRAME) {
                data |= *tr->tx_buf++ << 8;
              }
            }
            else {
              data = tr->def_val;
            }
            Chip_SPI_WriteFIFO (spi->reg, data | tr->ctrl);
            tr->tx_cnt++;
          }
          else {
            /* All data sent, disable TXRDY interrupt */
            Chip_SPI_DisableFIFOInts (spi->reg, SPI_FIFOINT_TXLVL);

            mask &= ~SPI_FIFOSTAT_TXNOTFULL;
          }
        }
      }

      stat = Chip_SPI_GetFIFOStatus(spi->reg);
    }
    while (stat & mask);

    if (tr->rx_cnt == tr->num) {
      /* Transfer completed */
      if (spi->reg->CFG & SPI_CFG_MASTER_EN) {
        spi->reg->STAT = SPI_STAT_EOT;
      }

      event |= ARM_SPI_EVENT_TRANSFER_COMPLETE;

      tr->num = 0U;
      spi->info->status.busy = 0U;
    }
  }

  /* Send event */
  if ((event != 0U) && (spi->info->cb_event != NULL)) {
    spi->info->cb_event (event);
  }
}


#if defined(SPI_DMA_ENABLE)
/**
  \fn          void SPI_TX_DMA_IRQHandler (const SPI_RESOURCES *spi)
  \brief       SPI TX DMA interrupt handler
  \param[in]   spi  Pointer to SPI resources
*/
void SPI_TX_DMA_IRQHandler (const SPI_RESOURCES *spi) {
  SPI_TRANSFER_INFO *tr = &spi->info->xfer;
  DMA_PERIPHERAL_CONTEXT_T  dma_context;
  uint32_t num;

  tr->tx_cnt += tr->tx_pend;

  if (tr->tx_cnt < tr->num) {
    /* Determine number of data to transmit */
    num = tr->num - tr->tx_cnt;

    if (num > 1024U) {
      num = 1024U;
    }

    tr->tx_pend = num;

    /* Increment buffer pointer and set transfer width */
    if (spi->info->flags & SPI_16B_FRAME) {
      tr->tx_buf += tr->tx_pend * 2;
      dma_context.width = DMA_XFERCFG_WIDTH_16;
      num *= 2;
    } else {
      tr->tx_buf += tr->tx_pend;
      dma_context.width = DMA_XFERCFG_WIDTH_8;
    }

    /* Configure transmit channel */
    dma_context.channel           = spi->dma_tx->ch;
    dma_context.register_location = (volatile uint32_t *)&(spi->reg->FIFOWR);
    dma_context.dst_increment     = tr->ctrl & (3UL << 14);
    dma_context.src_increment     = tr->ctrl & (3UL << 12);
    dma_context.write             = true;

    Chip_DMASERVICE_SingleBuffer (&dma_context, (uint32_t)tr->tx_buf, num);
  }
}

/**
  \fn          void SPI_R;X_DMA_IRQHandler (const SPI_RESOURCES *spi)
  \brief       SPI RX DMA interrupt handler
  \param[in]   spi  Pointer to SPI resources
*/
void SPI_RX_DMA_IRQHandler (const SPI_RESOURCES *spi) {
  SPI_TRANSFER_INFO *tr = &spi->info->xfer;
  DMA_PERIPHERAL_CONTEXT_T  dma_context;
  uint32_t num;

  tr->rx_cnt += tr->rx_pend;

  if (tr->rx_cnt < tr->num) {
    /* Determine number of data to receive */
    num = tr->num - tr->rx_cnt;

    if (num > 1024U) {
      num = 1024U;
    }

    tr->rx_pend = num;

    /* Increment buffer pointer and set transfer width */
    if (spi->info->flags & SPI_16B_FRAME) {
      tr->rx_buf += tr->rx_pend * 2;
      dma_context.width = DMA_XFERCFG_WIDTH_16;
      num *= 2;
    } else {
      tr->rx_buf += tr->rx_pend;
      dma_context.width = DMA_XFERCFG_WIDTH_8;
    }

    /* Configure receive channel */
    dma_context.channel           = spi->dma_rx->ch;
    dma_context.register_location = (volatile uint32_t *)&(spi->reg->FIFORD);
    dma_context.dst_increment     = (tr->ctrl >> 16) & (3UL << 14);
    dma_context.src_increment     = (tr->ctrl >> 16) & (3UL << 12);
    dma_context.write             = false;

    Chip_DMASERVICE_SingleBuffer (&dma_context, (uint32_t)tr->rx_buf, num);
  }
  else {
    if (spi->reg->CFG & SPI_CFG_MASTER_EN) {
      spi->reg->STAT = SPI_STAT_EOT;
    }

    /* All data received, transfer completed */
    tr->num = 0U;
    spi->info->status.busy = 0U;

    /* Send event */
    if (spi->info->cb_event != NULL) {
      spi->info->cb_event (ARM_SPI_EVENT_TRANSFER_COMPLETE);
    }
  }
}
#endif


