qm2813518589/LPC54606_Library/.pack/Keil/LPC54000_DFP.2.6.0/RTE_Driver/SPI_LPC5411x.c
#if defined(SPI3_DMA_EN)
void  SPI3_TX_DMA_Callback (int32_t val) {
  SPI_TX_DMA_IRQHandler (&SPI3_Resources);
}
void  SPI3_RX_DMA_Callback (int32_t val) {
  SPI_RX_DMA_IRQHandler (&SPI3_Resources);
}
#endif

/* Driver_SPI3 */
ARM_DRIVER_SPI Driver_SPI3 = {
  SPI_GetVersion,
  SPI_GetCapabilities,
  SPI3_Initialize,
  SPI3_Uninitialize,
  SPI3_PowerControl,
  SPI3_Send,
  SPI3_Receive,
  SPI3_Transfer,
  SPI3_GetDataCount,
  SPI3_Control,
  SPI3_GetStatus
};
#endif

#if defined(RTE_SPI4) && (RTE_SPI4 != 0)
/* SPI4 Wrapper Functions */
static int32_t        SPI4_Initialize          (ARM_SPI_SignalEvent_t pSignalEvent)                { return SPI_Initialize (pSignalEvent, &SPI4_Resources); }
static int32_t        SPI4_Uninitialize        (void)                                              { return SPI_Uninitialize (&SPI4_Resources); }
static int32_t        SPI4_PowerControl        (ARM_POWER_STATE state)                             { return SPI_PowerControl (state, &SPI4_Resources); }
static int32_t        SPI4_Send                (const void *data, uint32_t num)                    { return SPI_Send (data, num, &SPI4_Resources); }
static int32_t        SPI4_Receive             (void *data, uint32_t num)                          { return SPI_Receive (data, num, &SPI4_Resources); }
static int32_t        SPI4_Transfer            (const void *data_out, void *data_in, uint32_t num) { return SPI_Transfer (data_out, data_in, num, &SPI4_Resources); }
static uint32_t       SPI4_GetDataCount        (void)                                              { return SPI_GetDataCount (&SPI4_Resources); }
static int32_t        SPI4_Control             (uint32_t control, uint32_t arg)                    { return SPI_Control (control, arg, &SPI4_Resources); }
static ARM_SPI_STATUS SPI4_GetStatus           (void)                                              { return SPI_GetStatus (&SPI4_Resources); }
       void           SPI4_IRQHandler          (void)                                              {        SPI_IRQHandler (&SPI4_Resources); }

#if defined(SPI4_DMA_EN)
void  SPI4_TX_DMA_Callback (int32_t val) {
  SPI_TX_DMA_IRQHandler (&SPI4_Resources);
}
void  SPI4_RX_DMA_Callback (int32_t val) {
  SPI_RX_DMA_IRQHandler (&SPI4_Resources);
}
#endif

/* Driver_SPI4 */
ARM_DRIVER_SPI Driver_SPI4 = {
  SPI_GetVersion,
  SPI_GetCapabilities,
  SPI4_Initialize,
  SPI4_Uninitialize,
  SPI4_PowerControl,
  SPI4_Send,
  SPI4_Receive,
  SPI4_Transfer,
  SPI4_GetDataCount,
  SPI4_Control,
  SPI4_GetStatus
};
#endif

#if defined(RTE_SPI5) && (RTE_SPI5 != 0)
/* SPI5 Wrapper Functions */
static int32_t        SPI5_Initialize          (ARM_SPI_SignalEvent_t pSignalEvent)                { return SPI_Initialize (pSignalEvent, &SPI5_Resources); }
static int32_t        SPI5_Uninitialize        (void)                                              { return SPI_Uninitialize (&SPI5_Resources); }
static int32_t        SPI5_PowerControl        (ARM_POWER_STATE state)                             { return SPI_PowerControl (state, &SPI5_Resources); }
static int32_t        SPI5_Send                (const void *data, uint32_t num)                    { return SPI_Send (data, num, &SPI5_Resources); }
static int32_t        SPI5_Receive             (void *data, uint32_t num)                          { return SPI_Receive (data, num, &SPI5_Resources); }
static int32_t        SPI5_Transfer            (const void *data_out, void *data_in, uint32_t num) { return SPI_Transfer (data_out, data_in, num, &SPI5_Resources); }
static uint32_t       SPI5_GetDataCount        (void)                                              { return SPI_GetDataCount (&SPI5_Resources); }
static int32_t        SPI5_Control             (uint32_t control, uint32_t arg)                    { return SPI_Control (control, arg, &SPI5_Resources); }
static ARM_SPI_STATUS SPI5_GetStatus           (void)                                              { return SPI_GetStatus (&SPI5_Resources); }
       void           SPI5_IRQHandler          (void)                                              {        SPI_IRQHandler (&SPI5_Resources); }

#if defined(SPI5_DMA_EN)
void  SPI5_TX_DMA_Callback (int32_t val) {
  SPI_TX_DMA_IRQHandler (&SPI5_Resources);
}
void  SPI5_RX_DMA_Callback (int32_t val) {
  SPI_RX_DMA_IRQHandler (&SPI5_Resources);
}
#endif

/* Driver_SPI5 */
ARM_DRIVER_SPI Driver_SPI5 = {
  SPI_GetVersion,
  SPI_GetCapabilities,
  SPI5_Initialize,
  SPI5_Uninitialize,
  SPI5_PowerControl,
  SPI5_Send,
  SPI5_Receive,
  SPI5_Transfer,
  SPI5_GetDataCount,
  SPI5_Control,
  SPI5_GetStatus
};
#endif

#if defined(RTE_SPI6) && (RTE_SPI6 != 0)
/* SPI6 Wrapper Functions */
static int32_t        SPI6_Initialize          (ARM_SPI_SignalEvent_t pSignalEvent)                { return SPI_Initialize (pSignalEvent, &SPI6_Resources); }
static int32_t        SPI6_Uninitialize        (void)                                              { return SPI_Uninitialize (&SPI6_Resources); }
static int32_t        SPI6_PowerControl        (ARM_POWER_STATE state)                             { return SPI_PowerControl (state, &SPI6_Resources); }
static int32_t        SPI6_Send                (const void *data, uint32_t num)                    { return SPI_Send (data, num, &SPI6_Resources); }
static int32_t        SPI6_Receive             (void *data, uint32_t num)                          { return SPI_Receive (data, num, &SPI6_Resources); }
static int32_t        SPI6_Transfer            (const void *data_out, void *data_in, uint32_t num) { return SPI_Transfer (data_out, data_in, num, &SPI6_Resources); }
static uint32_t       SPI6_GetDataCount        (void)                                              { return SPI_GetDataCount (&SPI6_Resources); }
static int32_t        SPI6_Control             (uint32_t control, uint32_t arg)                    { return SPI_Control (control, arg, &SPI6_Resources); }
static ARM_SPI_STATUS SPI6_GetStatus           (void)                                              { return SPI_GetStatus (&SPI6_Resources); }
       void           SPI6_IRQHandler          (void)                                              {        SPI_IRQHandler (&SPI6_Resources); }

#if defined(SPI6_DMA_EN)
void  SPI6_TX_DMA_Callback (int32_t val) {
  SPI_TX_DMA_IRQHandler (&SPI6_Resources);
}
void  SPI6_RX_DMA_Callback (int32_t val) {
  SPI_RX_DMA_IRQHandler (&SPI6_Resources);
}
#endif

/* Driver_SPI6 */
ARM_DRIVER_SPI Driver_SPI6 = {
  SPI_GetVersion,
  SPI_GetCapabilities,
  SPI6_Initialize,
  SPI6_Uninitialize,
  SPI6_PowerControl,
  SPI6_Send,
  SPI6_Receive,
  SPI6_Transfer,
  SPI6_GetDataCount,
  SPI6_Control,
  SPI6_GetStatus
};
#endif

#if defined(RTE_SPI7) && (RTE_SPI7 != 0)
/* SPI7 Wrapper Functions */
static int32_t        SPI7_Initialize          (ARM_SPI_SignalEvent_t pSignalEvent)                { return SPI_Initialize (pSignalEvent, &SPI7_Resources); }
static int32_t        SPI7_Uninitialize        (void)                                              { return SPI_Uninitialize (&SPI7_Resources); }
static int32_t        SPI7_PowerControl        (ARM_POWER_STATE state)                             { return SPI_PowerControl (state, &SPI7_Resources); }
static int32_t        SPI7_Send                (const void *data, uint32_t num)                    { return SPI_Send (data, num, &SPI7_Resources); }
static int32_t        SPI7_Receive             (void *data, uint32_t num)                          { return SPI_Receive (data, num, &SPI7_Resources); }
static int32_t        SPI7_Transfer            (const void *data_out, void *data_in, uint32_t num) { return SPI_Transfer (data_out, data_in, num, &SPI7_Resources); }
static uint32_t       SPI7_GetDataCount        (void)                                              { return SPI_GetDataCount (&SPI7_Resources); }
static int32_t        SPI7_Control             (uint32_t control, uint32_t arg)                    { return SPI_Control (control, arg, &SPI7_Resources); }
static ARM_SPI_STATUS SPI7_GetStatus           (void)                                              { return SPI_GetStatus (&SPI7_Resources); }
       void           SPI7_IRQHandler          (void)                                              {        SPI_IRQHandler (&SPI7_Resources); }

#if defined(SPI7_DMA_EN)
void  SPI7_TX_DMA_Callback (int32_t val) {
  SPI_TX_DMA_IRQHandler (&SPI7_Resources);
}
void  SPI7_RX_DMA_Callback (int32_t val) {
  SPI_RX_DMA_IRQHandler (&SPI7_Resources);
}
#endif

/* Driver_SPI7 */
ARM_DRIVER_SPI Driver_SPI7 = {
  SPI_GetVersion,
  SPI_GetCapabilities,
  SPI7_Initialize,
  SPI7_Uninitialize,
  SPI7_PowerControl,
  SPI7_Send,
  SPI7_Receive,
  SPI7_Transfer,
  SPI7_GetDataCount,
  SPI7_Control,
  SPI7_GetStatus
};
#endif
